# Uber - Partner Business Modeling

## Table of Contents
* [Assignment](#Assignment)
* [Data Exploration](#Data-Exploration)
* [Question 1](#Question-1)
* [Question 2](#Question-2)
* [Question 3](#Question-3)
* [Question 4](#Question-4)
* [Question 5](#Question-5)
* [Question 6](#Question-6)

## Assignment

***Scenario 1:*** It is going to be a huge Saturday and there will need to be many more cars on the road than last week. In order to get drivers to go online, we're assessing the following two bonus options in terms of cost:

* **Option 1:** $50 for each driver that is online at least 8 hours, accepts 90% of requests, completes 10 trips, and has a rating of 4.7 or better during the time frame;

* **Option 2:** $4/trip for all drivers who complete 12 trips, and have a 4.7 or better rating.

Using the dataset provided and given Scenario 1, provide answers to the questions below:

**1.** How much would the total bonus payout be with Option 1?                                                     
**2.** How much would the total bonus payout be with Option 2?                                                     
**3.** How many drivers would qualify for a bonus under Option 1 but not under Option 2?                           
**4.** What percentages of drivers online completed less than 10 trips, had an acceptance rate of less than 90%, and had a rating of 4.7 or higher?


***Scenario 2:*** A taxi driver currently generates $200 per day in fares (before expenses), works six days a week, takes three weeks off, and has the following expenses:

Gas - $200 per week

Insurance - $400 per month

Vehicle rent (by the week) - $500

The driver doesn't pay gas and rent expenses on off weeks.

Now, let's assume that the same driver would buy a Town Car and partner with Uber. If he does, his gas expenses would go up by 5%, his insurance expense would decrease by 20%, and he would no longer be renting a vehicle. However, he would need to buy a car. The driver would still take three weeks off per year.

Given Scenario 2, provide answers to the questions below:

**5.** How much money (after expenses) does the taxi driver make per year without partnering with Uber?            
**6.** You are convincing the same driver above to buy a Town Car and partner with Uber. Assuming the new car is 40.000 USD, how much would the driver's gross fares need to increase per week to fully pay for the car in year 1 and maintain the same yearly profit margin as before?

## Data Exploration

The dataset is given in the file dataset_2.csv. The data come from rides on a busy Saturday and are aggregated on a driver level. The dataset provides information on the total number of completed trips, the driver's acceptance rate, the total number of hours on duty, and the average rating.

Only use this dataset to answer questions 1-4. There is no dataset provided for questions 5 and 6 as these are solely based on a given scenario.

In [75]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [76]:
data = pd.read_csv('dataset_2.csv')
data.head(3)

      Name  Trips Completed Accept Rate  Supply Hours  Rating
0    Abdul                1        100%             3     4.8
1  Abraham               12         83%             5     4.7
2  Adelina                1        100%             2     4.7

In [77]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             119 non-null    object
 1   Trips Completed  119 non-null    int64
 2   Accept Rate      119 non-null    object
 3   Supply Hours     119 non-null    int64
 4   Rating           119 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.8+ KB

In [78]:
data.shape

(119, 5)

In [79]:
data['Accept Rate'] = data['Accept Rate'].apply(lambda x: float(x[:-1]))
data.head(3)

      Name  Trips Completed  Accept Rate  Supply Hours  Rating
0    Abdul                1        100.0             3     4.8
1  Abraham               12         83.0             5     4.7
2  Adelina                1        100.0             2     4.7

## Question 1
How much would the total bonus payout be with Option 1?

In [80]:
data_question_1 = pd.DataFrame()

In [81]:
data_question_1 = data[(data['Supply Hours'] >= 8) 
                       & (data['Trips Completed'] >= 10)
                       & (data['Accept Rate'] >= 90)
                       & (data['Rating'] >= 4.7)]
data_question_1.head(3)

        Name  Trips Completed  Accept Rate  Supply Hours  Rating
11     Byron               15        100.0            10     4.9
12   Carlota               14        100.0             8     5.0
19  Dannette               14        100.0             9     4.9

In [82]:
print('We have', len(data_question_1), 'drivers that adapt to these 4 features. The total payment we will give them is $', 
     50 * len(data_question_1), '.')

We have 21 drivers that adapt to these 4 features. The total payment we will give them is $ 1050 .

## Question 2
How much would the total bonus payout be with Option 2?

In [83]:
data_question_2 = pd.DataFrame()

In [84]:
data_question_2 = data[(data['Trips Completed'] >= 12) & (data['Rating'] >= 4.7)]
data_question_2.head()

       Name  Trips Completed  Accept Rate  Supply Hours  Rating
1   Abraham               12         83.0             5     4.7
4      Alec               21         76.0            11     5.0
8   Augusta               19         84.0            11     4.7
10    Buffy               13         54.0             6     5.0
11    Byron               15        100.0            10     4.9

In [85]:
print('We have', len(data_question_2), 'drivers that adapt to these 2 features. The total payment is $', 
     4 * data_question_2['Trips Completed'].sum(), '.')

We have 46 drivers that adapt to these 2 features. The total payment is $ 2976 .

## Question 3
How many drivers would qualify for a bonus under Option 1 but not under Option 2?

In [86]:
data_question_3 = data_question_1.merge(data_question_2, on = data_question_1.columns.to_list(),
                                       how = 'left', indicator = True)
data_question_3.head(3)

       Name  Trips Completed  Accept Rate  Supply Hours  Rating _merge
0     Byron               15        100.0            10     4.9   both
1   Carlota               14        100.0             8     5.0   both
2  Dannette               14        100.0             9     4.9   both

In [87]:
data_question_3[data_question_3['_merge'] == 'left_only']

       Name  Trips Completed  Accept Rate  Supply Hours  Rating     _merge
16     Oren               11         91.0             9     4.8  left_only
17  Phyllis               10         90.0             8     4.8  left_only

## Question 4
 What percentages of drivers online completed less than 10 trips, had an acceptance rate of less than 90%, and had a rating of 4.7 or higher?

In [88]:
data_question_4 = data[(data['Trips Completed'] < 10) &
                      (data['Accept Rate'] < 90) &
                      (data['Rating'] >= 4.7)]
data_question_4.head(3)

         Name  Trips Completed  Accept Rate  Supply Hours  Rating
17       Cris                7         71.0             5     5.0
18     Dalila                7         57.0             2     4.8
20  Dannielle                3         67.0             5     5.0

In [89]:
percentage = (len(data_question_4) / len(data)) * 100
print('The percentage is : ',round(percentage,2), '%')

The percentage is :  10.92 %

## Question 5
How much money (after expenses) does the taxi driver make per year without partnering with Uber?

In [90]:
total_weeks_per_year = 52
weeks_off = 3
fare_per_day = 200
workday_per_week = 6
total_months_per_year = 12


gas_per_week = 200    
insurance_per_month = 400   
vehicle_rent_by_week = 500

In [91]:
total_expenses = (gas_per_week + vehicle_rent_by_week) * (total_weeks_per_year - weeks_off) +insurance_per_month * total_months_per_year
print('Total Expenses: $', total_expenses)

Total Expenses: $ 39100

In [92]:
total_revenue = (total_weeks_per_year - weeks_off) * workday_per_week * fare_per_day
print('Total Revenue: $', total_revenue)

Total Revenue: $ 58800

In [93]:
profit = (total_revenue - total_expenses) / total_revenue
print('Profit Margin:', round(profit * 100 , 2), '%')

Profit Margin: 33.5 %

## Question 6
You are convincing the same driver above to buy a Town Car and partner with Uber. Assuming the new car is 40.000 USD, how much would the driver's gross fares need to increase per week to fully pay for the car in year 1 and maintain the same yearly profit margin as before?

In [94]:
new_car = 40000
new_gas_per_week = 200 * 1.05         # increases by 5 percent
new_insurance_per_month = 400 * 0.8   # decreases by 20 percent

In [95]:
new_total_expenses = new_car + new_gas_per_week * (total_weeks_per_year - weeks_off) + new_insurance_per_month * total_months_per_year
print('New Total Expenses: $', new_total_expenses)

New Total Expenses: $ 54130.0

In [96]:
new_profit = (total_revenue - new_total_expenses) / total_revenue
print('New Profit Margin:',round(new_profit * 100,2), '%')

New Profit Margin: 7.94 %

In [97]:
fare_increase = total_revenue * (profit - new_profit) / (total_weeks_per_year - weeks_off)
print('The Weekly Fare Increase:$', round(fare_increase, 2))

The Weekly Fare Increase:$ 306.73